#include <stdio.h>  //main() , printf() 
// 1. #include  : (파일을 포함하는 명령어)
// 2. <stdio.h> : (다른곳에 만들어저있는파일을 포함시킨다)

// 1.void   : (자료형)
// 2.main   : 이름
// 3.()     : () -> 소괄호 : 함수 -> 영어이름 + ()
// 4.{}     : {} -> 중괄호 : 코드블럭 -> 함수의 영역
void main()
{
	printf("Hello world!");printf("Hello C!");
	// 1. printf("내용") : 출력을 담당하는 함수 : <stdio.h> 가 필요하다.
	// 2. ;  (세미콜론) : 문장이 끝났음을 알린다.
	// 문제 1) (가짜로 -> 나이 , 이름 , 이메일 , 전화번호 ) (자기소개)
	printf("15 , 홍길동 , callfather@naver.com , 010-1234-5678 ");
}
/*
1. 변수
2. 연산자 + - * / 등등
3. if (조건문)
4. for(반복문)
5. 배열(자료구조)
6. 함수
7. 포인터 
8. 배열문제점 (동적할당)
9. 이중포인터 -> 2차원 동적할당 
10. 동적할당의 문제점 = 링크드리스트

c--> cpp 
*/